{
  "pages.home": "Home",
  "pages.aboutMe": "About me",
  "pages.experience": "Experience",
  "pages.projects": "Projects",
  "pages.resume": "Resume",

  "home.greeting": "Hi, my name is",
  "home.title": "Building beautiful experiences for the web.",
  "home.subtitle": "As a frontend-focused software engineer, I am dedicated to bringing innovative and high-performing solutions to the digital landscape. Whether it's a complex web application or a simple landing page, I bring expertise, attention to detail, and a passion for crafting exceptional digital products.",

  "about.title": "About me",
  "about.description.first": "Hello! I'm Maximiliano, a software developer with a passion for creating innovative solutions for the internet. My journey in software development began in 2018, when I discovered my love for crafting websites. Since then, I have honed my skills in HTML, CSS, and JavaScript, and have had the opportunity to work with some of the biggest software companies and corporations, where I have contributed to the creation of accessible and inclusive digital products.",
  "about.description.second": "I continuously improve my skills and stay current with latest technologies to create user-centered digital solutions that are high-quality, reliable and meet client needs. I aim to create impactful and functional digital experiences.",
  "about.description.third": "In addition to my professional experience, I am also a mentor and teacher, having participated in the creation of a comprehensive course on Next.js, API Rest, React.js, and Material UI. I am always seeking opportunities to share my knowledge and help others grow in their careers.",
  "about.description.fourth": " Here are a few technologies I’ve been working with recently:",

  "experience.title": "Experience",
  "experience.subtitle": "Discover my recent professional journey in this section where I showcase my work experiences and achievements.",
  "experience.tasks.adsmurai.title": " Service and technology inspired by digital experts for digital marketing.. The headquarters in Barcelona, Spain. Some tasks here: ",
  "experience.tasks.adsmurai.one": "Code maintenance with good practices",
  "experience.tasks.adsmurai.two": "Implementation of new functionalities, applying unit tests and e2e",
  "experience.tasks.folcode.title": " is a software company. The headquarters is in San Juan, Argentina. Some tasks here:",
  "experience.tasks.folcode.one": "Component development and implementation of reusable UI library in BITCloud.",
  "experience.tasks.folcode.two": "Implementing authentication and authorization with KeyCloak.",
  "experience.tasks.folcode.tree": "Next js, React js, modular css projects with best practices implementing SOLID principles.",
  "experience.tasks.folcode.four": "Content creation and teaching in Folcademy's courses.",
  "experience.tasks.splight.title": " is an artificial intelligence company striving to achieve sustainability through technological innovation. Some tasks here:",
  "experience.tasks.splight.one": "Platform development based on data obtained from artificial intelligence and machine learning.",
  "experience.tasks.splight.two": "Development of a library of reusable UI components in NPM with React Js.",
  "experience.tasks.splight.tree": "Implementing authentication and authorization with Auth0.",
  "experience.tasks.splight.four": "Implementing web sockets to display statistical graphics consuming data from different sensors.",
  "experience.tasks.bitlogic.title": " is a software company. The headquarters is in Córdoba, Argentina. Some tasks here:",
  "experience.tasks.bitlogic.one": "Development and implementation of a Q&A section applied to sports science.",
  "experience.tasks.bitlogic.two": "Authentication and authorization with Auth0.",
  "experience.tasks.bitlogic.tree": "General SEO improvements.",
  "experience.tasks.bitlogic.four": "Implementing testing with TDD and BDD.",

  "projects.title": "Projects",
  "projects.subtitle": "Here, you will find a collection of my work. To give you a complete understanding of my capabilities, I have made both the live websites and the corresponding source code available on GitHub.",
  "projects.psychology.description": "Site for the psychology professional. Contact, information, data are some of the sections.",
  "projects.travel.description": "Responsive landing page for a tourism company. With relevant and contact information.",
  "projects.own.description": "My own web site.",
  "projects.ichoose.description": "An AI model. Experimental. Under Construction"
}
