{
  "pages.home": "Home",
  "pages.aboutMe": "Sobre mi",
  "pages.experience": "Experiencia",
  "pages.projects": "Proyectos",
  "pages.resume": "Curriculum",

  "home.greeting": "Hola, mi nombre es",
  "home.title": "Frontend Developer especializado en UI/UX con enfoque en performance",
  "home.subtitle": "Transformo ideas en experiencias digitales excepcionales, combinando diseño intuitivo con código optimizado para crear productos que los usuarios realmente aman usar.",
  "home.cta": "Ver mis proyectos",

  "about.title": "Sobre mi",
  "about.description.first": "¡Hola! Soy Maximiliano, desarrollador de software con pasión por crear soluciones digitales innovadoras, accesibles y centradas en el usuario.",
  "about.description.second": "Comencé mi camino en el desarrollo en 2018, creando sitios web por curiosidad, y desde entonces he perfeccionado mis habilidades en HTML, CSS y JavaScript. A lo largo de los años, he trabajado en proyectos para algunas de las compañías de software más importantes, contribuyendo al desarrollo de productos digitales funcionales e inclusivos.",
  "about.description.third": "Siempre estoy buscando formas de mejorar tanto técnica como profesionalmente. Me esfuerzo por mantenerme actualizado con las últimas tecnologías, frameworks modernos y buenas prácticas para crear experiencias digitales de alta calidad, escalables y confiables.",
  "about.description.fourth": "Además de mi experiencia como desarrollador, también soy mentor y profesor. Participé en la creación de un curso integral sobre desarrollo con Next.js, APIs REST, React.js y Material UI, donde combiné teoría y práctica para ayudar a otros a crecer en sus carreras.",
  "about.description.fifth": "Últimamente, he estado explorando con entusiasmo el uso de herramientas de inteligencia artificial aplicadas al desarrollo, incluyendo modelos de lenguaje (LLMs), agentes IA y MCP. Creo firmemente que la IA marcará un antes y un después en cómo diseñamos, desarrollamos y colaboramos en proyectos digitales.",
  "about.description.sixth": "Aquí hay algunas tecnologías con las que he estado trabajando recientemente:",

  "experience.title": "Experiencia",
  "experience.subtitle": "Descubre mi reciente viaje profesional en esta sección donde muestro mis experiencias laborales y logros.",
  "experience.periods.adsmurai": "Junio 2023 - Presente",
  "experience.periods.folcode": "Abril 2022 - Junio 2023",
  "experience.periods.splight": "Enero 2022 - Marzo 2022",
  "experience.periods.bitlogic": "Enero 2021 - Diciembre 2021",
  "experience.tasks.adsmurai.title": " Servicio y tecnologías inspirada por expertos digitales para marketing. La sede principal está en Barcelona, España. Aquí algunas tareas: ",
  "experience.tasks.adsmurai.one": "Concepción, desarrollo y mantenimiento de plataforma de transformación de datos a feeds optimizados (marketing digital).",
  "experience.tasks.adsmurai.two": "Participé en el diseño y desarrollo de dashboards interactivos para múltiples clientes en simultáneo, optimizando la visualización de métricas claves mediante widgets y gráficos.",
  "experience.tasks.adsmurai.three": "Mantenimiento y actualización de librería de componentes reutilizables en React.js, publicada en npm y utilizada como base en múltiples proyectos internos de la empresa.",
  "experience.tasks.adsmurai.four": "Implementación y optimización del ecosistema React utilizando las últimas versiones de Vite, mejorando el rendimiento y reduciendo significativamente los tiempos de carga y compilación en los proyectos.",
  "experience.tasks.adsmurai.five": "Participación en procesos de reclutamiento de nuevos dev y mentoría de los mismos.",
  "experience.tasks.folcode.title": " es una empresa de software. La sede principal está en San Juan, Argentina. Aquí algunas tareas:",
  "experience.tasks.folcode.one": "Desarrollo de componentes e implementación de una biblioteca UI reutilizable en BITCloud.",
  "experience.tasks.folcode.two": "Implementación de autenticación y autorización con KeyCloak.",
  "experience.tasks.folcode.tree": "Proyectos de Next js, React js y css modulares con prácticas recomendadas aplicando principios SOLID.",
  "experience.tasks.folcode.four": "Creación de contenido y rol de profesor en los cursos dictados por Folcademy.",
  "experience.tasks.splight.title": " es una empresa de inteligencia artificial que busca lograr la sostenibilidad a través de la innovación tecnológica. Algunas tareas aquí:",
  "experience.tasks.splight.one": "Desarrollo de plataforma basado en datos obtenidos de inteligencia artificial y machine learning.",
  "experience.tasks.splight.two": "Desarrollo de una biblioteca de componentes UI reutilizables en NPM con React Js.",
  "experience.tasks.splight.tree": "Implementación de autenticación y autorización con Auth0.",
  "experience.tasks.splight.four": "Implementación de web sockets para mostrar gráficos estadísticos consumiendo datos de diferentes sensores.",
  "experience.tasks.bitlogic.title": " es una empresa de software. La sede se encuentra en Córdoba, Argentina. Principales tareas aquí:",
  "experience.tasks.bitlogic.one": "Desarrollo e implementación de una sección de preguntas y respuestas aplicadas a la ciencia del deporte.",
  "experience.tasks.bitlogic.two": "Autenticación y autorización con Auth0.",
  "experience.tasks.bitlogic.tree": "Mejoras generales de SEO.",
  "experience.tasks.bitlogic.four": "Implementación de testeo con TDD and BDD.",

  "projects.title": "Proyectos",
  "projects.subtitle": "Una muestra de mi evolución profesional a través de diferentes proyectos que reflejan mi crecimiento técnico y creativo en el desarrollo frontend.",
  "projects.psychology.description": "Sitio para el profesional de la psicología. Contacto, datos, información,  son algunas de las secciones.",
  "projects.travel.description": "Landing page responsiva para una empresa turística. Con información relevante y de contacto.",
  "projects.own.description": "Mi propio sitio web.",
  "projects.ichoose.description": "Modelo de Inteligencia Artificial. Experimental. En construcción.",
  "projects.pokedex.description": "Un listado de pokemons con el detalle de cada uno de ellos.",
  "projects.podcast.description": "Un listado de podcast con el detalle de cada uno de ellos.",
  "projects.priceHawk.description": "Rastreador de precios para productos con historial de precios.",

  "chatbot.header.title": "Asistente Virtual",
  "chatbot.header.status": "Siempre disponible",
  "chatbot.messages.welcome": "¡Hola! 👋 Soy el asistente virtual de Maximiliano. ¿En qué puedo ayudarte hoy?",
  "chatbot.messages.typing": "Escribiendo...",
  "chatbot.messages.defaultResponse": "Gracias por tu pregunta. Para consultas específicas, te recomiendo contactarme directamente a través de mi email o LinkedIn. ¡Estoy aquí para ayudarte!",
  "chatbot.quickResponses.label": "Preguntas frecuentes:",
  "chatbot.quickResponses.technologies.question": "¿En qué tecnologías trabajas?",
  "chatbot.quickResponses.technologies.answer": "Trabajo principalmente con React, Next.js, TypeScript, Material UI, Node.js y bases de datos como PostgreSQL. También tengo experiencia con herramientas como Vercel, Git, y metodologías ágiles.",
  "chatbot.quickResponses.resume.question": "¿Puedes enviarme tu CV?",
  "chatbot.quickResponses.resume.answer": "¡Por supuesto! Puedes descargar mi CV actualizado desde la sección 'Resume' de mi portfolio.",
  "chatbot.quickResponses.experience.question": "¿Cuál es tu experiencia?",
  "chatbot.quickResponses.experience.answer": "Tengo más de 5 años de experiencia en desarrollo frontend, trabajando en proyectos desde landing pages hasta aplicaciones web complejas. He trabajado tanto en proyectos freelance como en empresas.",
  "chatbot.quickResponses.freelance.question": "¿Haces proyectos freelance?",
  "chatbot.quickResponses.freelance.answer": "Sí, estoy disponible para proyectos freelance. Me especializo en desarrollo frontend con React y frameworks modernos. Puedes contactarme a través de mi email o LinkedIn para discutir tu proyecto.",
  "chatbot.quickResponses.contact.question": "¿Cómo puedo contactarte?",
  "chatbot.quickResponses.contact.answer": "Puedes contactarme a través de mi email: claudioacevedo25@gmail.com o conectar conmigo en LinkedIn. También puedes seguirme en GitHub para ver mis proyectos más recientes.",
  "chatbot.input.placeholder": "Escribe tu pregunta..."
}
